XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/ef_data_0_reg.h
/**
  ******************************************************************************
  * @file    ef_data_0_reg.h
  * @version V1.0
  * @date    2021-07-31
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __EF_DATA_0_REG_H__
#define __EF_DATA_0_REG_H__

#include "bl606p.h"

/* 0x0 : ef_cfg_0 */
#define EF_DATA_0_EF_CFG_0_OFFSET         (0x0)
#define EF_DATA_0_EF_SF_AES_MODE          EF_DATA_0_EF_SF_AES_MODE
#define EF_DATA_0_EF_SF_AES_MODE_POS      (0U)
#define EF_DATA_0_EF_SF_AES_MODE_LEN      (2U)
#define EF_DATA_0_EF_SF_AES_MODE_MSK      (((1U << EF_DATA_0_EF_SF_AES_MODE_LEN) - 1) << EF_DATA_0_EF_SF_AES_MODE_POS)
#define EF_DATA_0_EF_SF_AES_MODE_UMSK     (~(((1U << EF_DATA_0_EF_SF_AES_MODE_LEN) - 1) << EF_DATA_0_EF_SF_AES_MODE_POS))
#define EF_DATA_0_EF_AI_DIS               EF_DATA_0_EF_AI_DIS
#define EF_DATA_0_EF_AI_DIS_POS           (2U)
#define EF_DATA_0_EF_AI_DIS_LEN           (1U)
#define EF_DATA_0_EF_AI_DIS_MSK           (((1U << EF_DATA_0_EF_AI_DIS_LEN) - 1) << EF_DATA_0_EF_AI_DIS_POS)
#define EF_DATA_0_EF_AI_DIS_UMSK          (~(((1U << EF_DATA_0_EF_AI_DIS_LEN) - 1) << EF_DATA_0_EF_AI_DIS_POS))
#define EF_DATA_0_EF_CPU0_DIS             EF_DATA_0_EF_CPU0_DIS
#define EF_DATA_0_EF_CPU0_DIS_POS         (3U)
#define EF_DATA_0_EF_CPU0_DIS_LEN         (1U)
#define EF_DATA_0_EF_CPU0_DIS_MSK         (((1U << EF_DATA_0_EF_CPU0_DIS_LEN) - 1) << EF_DATA_0_EF_CPU0_DIS_POS)
#define EF_DATA_0_EF_CPU0_DIS_UMSK        (~(((1U << EF_DATA_0_EF_CPU0_DIS_LEN) - 1) << EF_DATA_0_EF_CPU0_DIS_POS))
#define EF_DATA_0_EF_SBOOT_EN             EF_DATA_0_EF_SBOOT_EN
#define EF_DATA_0_EF_SBOOT_EN_POS         (4U)
#define EF_DATA_0_EF_SBOOT_EN_LEN         (2U)
#define EF_DATA_0_EF_SBOOT_EN_MSK         (((1U << EF_DATA_0_EF_SBOOT_EN_LEN) - 1) << EF_DATA_0_EF_SBOOT_EN_POS)
#define EF_DATA_0_EF_SBOOT_EN_UMSK        (~(((1U << EF_DATA_0_EF_SBOOT_EN_LEN) - 1) << EF_DATA_0_EF_SBOOT_EN_POS))
#define EF_DATA_0_EF_UART_DIS             EF_DATA_0_EF_UART_DIS
#define EF_DATA_0_EF_UART_DIS_POS         (6U)
#define EF_DATA_0_EF_UART_DIS_LEN         (4U)
#define EF_DATA_0_EF_UART_DIS_MSK         (((1U << EF_DATA_0_EF_UART_DIS_LEN) - 1) << EF_DATA_0_EF_UART_DIS_POS)
#define EF_DATA_0_EF_UART_DIS_UMSK        (~(((1U << EF_DATA_0_EF_UART_DIS_LEN) - 1) << EF_DATA_0_EF_UART_DIS_POS))
#define EF_DATA_0_EF_NO_XTAL              EF_DATA_0_EF_NO_XTAL
#define EF_DATA_0_EF_NO_XTAL_POS          (10U)
#define EF_DATA_0_EF_NO_XTAL_LEN          (1U)
#define EF_DATA_0_EF_NO_XTAL_MSK          (((1U << EF_DATA_0_EF_NO_XTAL_LEN) - 1) << EF_DATA_0_EF_NO_XTAL_POS)
#define EF_DATA_0_EF_NO_XTAL_UMSK         (~(((1U << EF_DATA_0_EF_NO_XTAL_LEN) - 1) << EF_DATA_0_EF_NO_XTAL_POS))
#define EF_DATA_0_EF_FORCE_NO_TRIM        EF_DATA_0_EF_FORCE_NO_TRIM
#define EF_DATA_0_EF_FORCE_NO_TRIM_POS    (11U)
#define EF_DATA_0_EF_FORCE_NO_TRIM_LEN    (1U)
#define EF_DATA_0_EF_FORCE_NO_TRIM_MSK    (((1U << EF_DATA_0_EF_FORCE_NO_TRIM_LEN) - 1) << EF_DATA_0_EF_FORCE_NO_TRIM_POS)
#define EF_DATA_0_EF_FORCE_NO_TRIM_UMSK   (~(((1U << EF_DATA_0_EF_FORCE_NO_TRIM_LEN) - 1) << EF_DATA_0_EF_FORCE_NO_TRIM_POS))
#define EF_DATA_0_EF_SF_KEY_RE_SEL        EF_DATA_0_EF_SF_KEY_RE_SEL
#define EF_DATA_0_EF_SF_KEY_RE_SEL_POS    (12U)
#define EF_DATA_0_EF_SF_KEY_RE_SEL_LEN    (2U)
#define EF_DATA_0_EF_SF_KEY_RE_SEL_MSK    (((1U << EF_DATA_0_EF_SF_KEY_RE_SEL_LEN) - 1) << EF_DATA_0_EF_SF_KEY_RE_SEL_POS)
#define EF_DATA_0_EF_SF_KEY_RE_SEL_UMSK   (~(((1U << EF_DATA_0_EF_SF_KEY_RE_SEL_LEN) - 1) << EF_DATA_0_EF_SF_KEY_RE_SEL_POS))
#define EF_DATA_0_EF_SDU_DIS              EF_DATA_0_EF_SDU_DIS
#define EF_DATA_0_EF_SDU_DIS_POS          (14U)
#define EF_DATA_0_EF_SDU_DIS_LEN          (1U)
#define EF_DATA_0_EF_SDU_DIS_MSK          (((1U << EF_DATA_0_EF_SDU_DIS_LEN) - 1) << EF_DATA_0_EF_SDU_DIS_POS)
#define EF_DATA_0_EF_SDU_DIS_UMSK         (~(((1U << EF_DATA_0_EF_SDU_DIS_LEN) - 1) << EF_DATA_0_EF_SDU_DIS_POS))
#define EF_DATA_0_EF_BTDM_DIS             EF_DATA_0_EF_BTDM_DIS
#define EF_DATA_0_EF_BTDM_DIS_POS         (15U)
#define EF_DATA_0_EF_BTDM_DIS_LEN         (1U)
#define EF_DATA_0_EF_BTDM_DIS_MSK         (((1U << EF_DATA_0_EF_BTDM_DIS_LEN) - 1) << EF_DATA_0_EF_BTDM_DIS_POS)
#define EF_DATA_0_EF_BTDM_DIS_UMSK        (~(((1U << EF_DATA_0_EF_BTDM_DIS_LEN) - 1) << EF_DATA_0_EF_BTDM_DIS_POS))
#define EF_DATA_0_EF_WIFI_DIS             EF_DATA_0_EF_WIFI_DIS
#define EF_DATA_0_EF_WIFI_DIS_POS         (16U)
#define EF_DATA_0_EF_WIFI_DIS_LEN         (1U)
#define EF_DATA_0_EF_WIFI_DIS_MSK         (((1U << EF_DATA_0_EF_WIFI_DIS_LEN) - 1) << EF_DATA_0_EF_WIFI_DIS_POS)
#define EF_DATA_0_EF_WIFI_DIS_UMSK        (~(((1U << EF_DATA_0_EF_WIFI_DIS_LEN) - 1) << EF_DATA_0_EF_WIFI_DIS_POS))
#define EF_DATA_0_EF_0_KEY_ENC_EN         EF_DATA_0_EF_0_KEY_ENC_EN
#define EF_DATA_0_EF_0_KEY_ENC_EN_POS     (17U)
#define EF_DATA_0_EF_0_KEY_ENC_EN_LEN     (1U)
#define EF_DATA_0_EF_0_KEY_ENC_EN_MSK     (((1U << EF_DATA_0_EF_0_KEY_ENC_EN_LEN) - 1) << EF_DATA_0_EF_0_KEY_ENC_EN_POS)
#define EF_DATA_0_EF_0_KEY_ENC_EN_UMSK    (~(((1U << EF_DATA_0_EF_0_KEY_ENC_EN_LEN) - 1) << EF_DATA_0_EF_0_KEY_ENC_EN_POS))
#define EF_DATA_0_EF_CAM_DIS              EF_DATA_0_EF_CAM_DIS
#define EF_DATA_0_EF_CAM_DIS_POS          (18U)
#define EF_DATA_0_EF_CAM_DIS_LEN          (1U)
#define EF_DATA_0_EF_CAM_DIS_MSK          (((1U << EF_DATA_0_EF_CAM_DIS_LEN) - 1) << EF_DATA_0_EF_CAM_DIS_POS)
#define EF_DATA_0_EF_CAM_DIS_UMSK         (~(((1U << EF_DATA_0_EF_CAM_DIS_LEN) - 1) << EF_DATA_0_EF_CAM_DIS_POS))
#define EF_DATA_0_EF_M154_DIS             EF_DATA_0_EF_M154_DIS
#define EF_DATA_0_EF_M154_DIS_POS         (19U)
#define EF_DATA_0_EF_M154_DIS_LEN         (1U)
#define EF_DATA_0_EF_M154_DIS_MSK         (((1U << EF_DATA_0_EF_M154_DIS_LEN) - 1) << EF_DATA_0_EF_M154_DIS_POS)
#define EF_DATA_0_EF_M154_DIS_UMSK        (~(((1U << EF_DATA_0_EF_M154_DIS_LEN) - 1) << EF_DATA_0_EF_M154_DIS_POS))
#define EF_DATA_0_EF_CPU1_DIS             EF_DATA_0_EF_CPU1_DIS
#define EF_DATA_0_EF_CPU1_DIS_POS         (20U)
#define EF_DATA_0_EF_CPU1_DIS_LEN         (1U)
#define EF_DATA_0_EF_CPU1_DIS_MSK         (((1U << EF_DATA_0_EF_CPU1_DIS_LEN) - 1) << EF_DATA_0_EF_CPU1_DIS_POS)
#define EF_DATA_0_EF_CPU1_DIS_UMSK        (~(((1U << EF_DATA_0_EF_CPU1_DIS_LEN) - 1) << EF_DATA_0_EF_CPU1_DIS_POS))
#define EF_DATA_0_EF_CPU_RST_DBG_DIS      EF_DATA_0_EF_CPU_RST_DBG_DIS
#define EF_DATA_0_EF_CPU_RST_DBG_DIS_POS  (21U)
#define EF_DATA_0_EF_CPU_RST_DBG_DIS_LEN  (1U)
#define EF_DATA_0_EF_CPU_RST_DBG_DIS_MSK  (((1U << EF_DATA_0_EF_CPU_RST_DBG_DIS_LEN) - 1) << EF_DATA_0_EF_CPU_RST_DBG_DIS_POS)
#define EF_DATA_0_EF_CPU_RST_DBG_DIS_UMSK (~(((1U << EF_DATA_0_EF_CPU_RST_DBG_DIS_LEN) - 1) << EF_DATA_0_EF_CPU_RST_DBG_DIS_POS))
#define EF_DATA_0_EF_SE_DBG_DIS           EF_DATA_0_EF_SE_DBG_DIS
#define EF_DATA_0_EF_SE_DBG_DIS_POS       (22U)
#define EF_DATA_0_EF_SE_DBG_DIS_LEN       (1U)
#define EF_DATA_0_EF_SE_DBG_DIS_MSK       (((1U << EF_DATA_0_EF_SE_DBG_DIS_LEN) - 1) << EF_DATA_0_EF_SE_DBG_DIS_POS)
#define EF_DATA_0_EF_SE_DBG_DIS_UMSK      (~(((1U << EF_DATA_0_EF_SE_DBG_DIS_LEN) - 1) << EF_DATA_0_EF_SE_DBG_DIS_POS))
#define EF_DATA_0_EF_EFUSE_DBG_DIS        EF_DATA_0_EF_EFUSE_DBG_DIS
#define EF_DATA_0_EF_EFUSE_DBG_DIS_POS    (23U)
#define EF_DATA_0_EF_EFUSE_DBG_DIS_LEN    (1U)
#define EF_DATA_0_EF_EFUSE_DBG_DIS_MSK    (((1U << EF_DATA_0_EF_EFUSE_DBG_DIS_LEN) - 1) << EF_DATA_0_EF_EFUSE_DBG_DIS_POS)
#define EF_DATA_0_EF_EFUSE_DBG_DIS_UMSK   (~(((1U << EF_DATA_0_EF_EFUSE_DBG_DIS_LEN) - 1) << EF_DATA_0_EF_EFUSE_DBG_DIS_POS))
#define EF_DATA_0_EF_DBG_JTAG_1_DIS       EF_DATA_0_EF_DBG_JTAG_1_DIS
#define EF_DATA_0_EF_DBG_JTAG_1_DIS_POS   (24U)
#define EF_DATA_0_EF_DBG_JTAG_1_DIS_LEN   (2U)
#define EF_DATA_0_EF_DBG_JTAG_1_DIS_MSK   (((1U << EF_DATA_0_EF_DBG_JTAG_1_DIS_LEN) - 1) << EF_DATA_0_EF_DBG_JTAG_1_DIS_POS)
#define EF_DATA_0_EF_DBG_JTAG_1_DIS_UMSK  (~(((1U << EF_DATA_0_EF_DBG_JTAG_1_DIS_LEN) - 1) << EF_DATA_0_EF_DBG_JTAG_1_DIS_POS))
#define EF_DATA_0_EF_DBG_JTAG_0_DIS       EF_DATA_0_EF_DBG_JTAG_0_DIS
#define EF_DATA_0_EF_DBG_JTAG_0_DIS_POS   (26U)
#define EF_DATA_0_EF_DBG_JTAG_0_DIS_LEN   (2U)
#define EF_DATA_0_EF_DBG_JTAG_0_DIS_MSK   (((1U << EF_DATA_0_EF_DBG_JTAG_0_DIS_LEN) - 1) << EF_DATA_0_EF_DBG_JTAG_0_DIS_POS)
#define EF_DATA_0_EF_DBG_JTAG_0_DIS_UMSK  (~(((1U << EF_DATA_0_EF_DBG_JTAG_0_DIS_LEN) - 1) << EF_DATA_0_EF_DBG_JTAG_0_DIS_POS))
#define EF_DATA_0_EF_DBG_MODE             EF_DATA_0_EF_DBG_MODE
#define EF_DATA_0_EF_DBG_MODE_POS         (28U)
#define EF_DATA_0_EF_DBG_MODE_LEN         (4U)
#define EF_DATA_0_EF_DBG_MODE_MSK         (((1U << EF_DATA_0_EF_DBG_MODE_LEN) - 1) << EF_DATA_0_EF_DBG_MODE_POS)
#define EF_DATA_0_EF_DBG_MODE_UMSK        (~(((1U << EF_DATA_0_EF_DBG_MODE_LEN) - 1) << EF_DATA_0_EF_DBG_MODE_POS))

